package lab4;


/**
 * Цей клас представляє контейнер, який вміщує легковаговий об'єкт {@link iGraphicObject} {@link PrimitiveObject}
 * та доповняє його полями, що містять координати, на яких буде намальовано об'єкт.
 * Містить метод для малювання об'єкта.
 *
 */
public class Dot{
	/**
	 * Це поле містить коорднату x об'єкта.
	 */
	private int x;
	/**
	 * Це поле містить коорднату y об'єкта.
	 */
	private int y;
	/**
	 * Це поле містить легковаговий об'єкт, що визначає зовнішній вигляд для точки.
	 */
	private iGraphicObject primitive;
	
	
	/**
	 * Конструктор {@link Dot} визначає координати та примітивний графічний об'єкт.
	 *
	 * @param x Координата x точки.
	 * @param y Координата y точки. 
	 * @param primitive Графічний об'єкт, що визначає зовнішній вигляд точки.
	 */
	public Dot(int x, int y, iGraphicObject primitive) {
		this.x = x;
		this.y = y;
		this.primitive = primitive;
	}
	
	/**
	 * Малює точку, використовуючи метод для малювання з примітивного графічного об'єкта, на вказаних координатах.
	 */
	public void draw() {
		primitive.draw(x, y);
	}

}
